Repository: Whitenz/foodgram
Catalog: backend/conf/locale/*/LC_MESSAGES/django.po
Languages: ru

source: recipes
ru: рецепты

source: Fills Ingredient table from a csv file
ru: Заполняет таблицу Ingredient данными из csv-файла

source: Looking for a file with data to upload...
ru: Поиск файла с данными для загрузки...

source: The following path is set:
ru: Установлен следующий путь к файлу:

source: The data file for database does not exist
ru: Файл с данными для БД не найден

source: The data in the table already exists
ru: Данные в таблице уже существуют

source: Loading data into the table "Ingredient"
ru: Загрузка данных в таблицу "Ingredient"

source: Number of fields in the file does not match
ru: Количество полей в файле не совпадает с таблицей

source: Successful data upload
ru: Данные загружены успешно

source: Entities in the table after loading -
ru: Записей в таблице после загрузки -

source: tag name
ru: имя тега

source: tag colors
ru: цвет тега

source: slug of the tag
ru: слаг тега

source: tag
ru: тег

source: tags
ru: теги

source: ingredient name
ru: название ингредиента

source: ingredient measurement measure
ru: единица измерения ингредиента

source: ingredient
ru: ингредиент

source: ingredients
ru: ингредиенты

source: recipe tags
ru: теги рецепта

source: author of the recipe
ru: автор рецепта

source: recipe ingredients
ru: ингредиенты рецепта

source: recipe name
ru: имя рецепта

source: recipe image
ru: изображение рецепта

source: recipe description
ru: описание рецепта

source: cooking time in minutes
ru: время приготовления в минутах

source: date of public
ru: дата публикации

source: recipe
ru: рецепт

source: number in favorites
ru: количество в избранном

source: amount of ingredient for the recipe
ru: количество ингредиентов для рецепта

source: amount of ingredients
ru: количество ингредиентов

source: tags of recipe
ru: теги рецепта

source: favorite recipes
ru: избранные рецепты

source: favorite
ru: избранное

source: user shopping cart
ru: список покупок пользователя

source: shopping cart
ru: список покупок

source: Ingredients should not be repeated.
ru: Ингредиенты не должны повторяться.

source: You have already added this recipe.
ru: Вы уже добавили этот рецепт.

source: You did not add this recipe.
ru: Вы не добавляли этот рецепт.

source: Shopping list for {} - {}
ru: Список покупок для {} - {}

source: Only a hex string is allowed.
ru: Допускается только HEX-строка.

source: Invalid length. Must be %(length)d characters.
ru: Неверная длина. Должно быть %(length)d символов.

source: subscription from
ru: подписка от

source: subscribed to
ru: подписка на

source: subscription
ru: подписка

source: subscriptions
ru: подписки

source: Subscription {} to {}
ru: подписка {} на {}

source: You cannot subscribe to yourself.
ru: Вы не можете подписаться на себя.

source: You have already subscribed to this user.
ru: Вы уже подписаны на этого пользователя.

source: You are not subscribed to this user.
ru: Вы не подписывались на этого пользователя.
